from fastui import components as c

about_ahp = [
    c.Markdown(
        text="""# Метод анализа иерархий

### История и суть

В 1970 г. Томас Саати (США) разработал метод анализа иерархий - **Analityc hierarchy process (AHP)**. Относится к классу критериальных методов. Получил широкое распространение и до сих пор активно используется в управленческой практике. Приводит ЛПР не к «правильному» решению, а к варианту, наилучшим образом согласующемуся с его пониманием сути проблемы и требованиями к ее решению.

### Этапы метода

1. Выделение проблемы. Определение цели.
2. Выделение основных критериев и альтернатив. 
3. Построение иерархии: дерево от цели через критерии к альтернативам. 
4. Построение матрицы попарных сравнений критериев по цели и альтернатив по критериям. 
5. Применение методики анализа полученных матриц. 
6. Определение весов альтернатив по системе иерархии.

"""  # noqa: E501
    ),
    c.Image(src='/static/ahp_tree.jpeg'),
]
